---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
source: html/8dad8828-9633-703e-2822-b7af3eec97c3.htm
---
# CodeCheckingParameterServiceData Methods

Returns the list of Ids of the current elements.